In [4]:
import pandas as pd
import numpy as np

In [3]:
pd.__version__

'1.3.4'

In [1]:
!python --version

Python 3.9.7

In [72]:
class Bingo:
    def __init__(self, arr2d=((),)):
        self.df = pd.DataFrame(arr2d)
        self.mark = pd.DataFrame(np.zeros(self.df.shape))
        self.mark.index = self.df.index
        self.mark.columns = self.df.columns
        self.mark = self.mark.astype("bool")
        self.won = False
    def call(self, num):
        self.mark = self.mark | (self.df == num)
        if self.check():
            score = self.score()
            print("Found score!", score)
            self.won = True
            return score
    def check(self):
        is_col = (self.mark.sum() == self.mark.shape[0]).sum()
        is_row = (self.mark.T.sum() == self.mark.shape[1]).sum()
#         print(is_col, is_row)
        return is_col or is_row
    def score(self):
        return self.df[~self.mark].sum().sum().astype('int')  # we need sum of values NOT marked!

In [13]:
def readDay4(fname):
    with open(fname) as f:
        lines = f.readlines()
    calls = [int(n) for n in lines[0].split(",")]
    boards = [[]]

    for line in lines[2:]:
        if not len(line.strip()):
            boards.append([])
            continue
        board = boards[-1]
        board.append([int(n.strip()) for n in line.strip().split()])
    return calls, boards

In [14]:
calls, boards = readDay4("day4.txt")

In [15]:
calls

[26,
 38,
 2,
 15,
 36,
 8,
 12,
 46,
 88,
 72,
 32,
 35,
 64,
 19,
 5,
 66,
 20,
 52,
 74,
 3,
 59,
 94,
 45,
 56,
 0,
 6,
 67,
 24,
 97,
 50,
 92,
 93,
 84,
 65,
 71,
 90,
 96,
 21,
 87,
 75,
 58,
 82,
 14,
 53,
 95,
 27,
 49,
 69,
 16,
 89,
 37,
 13,
 1,
 81,
 60,
 79,
 51,
 18,
 48,
 33,
 42,
 63,
 39,
 34,
 62,
 55,
 47,
 54,
 23,
 83,
 77,
 9,
 70,
 68,
 85,
 86,
 91,
 41,
 4,
 61,
 78,
 31,
 22,
 76,
 40,
 17,
 30,
 98,
 44,
 25,
 80,
 73,
 11,
 28,
 7,
 99,
 29,
 57,
 43,
 10]

In [16]:
len(boards)

100

In [17]:
boards[-1]

[[67, 11, 21, 53, 60],
 [52, 58, 54, 94, 47],
 [84, 46, 72, 81, 16],
 [31, 51, 23, 36, 97],
 [80, 43, 75, 99, 79]]

In [76]:
blist = [Bingo(board) for board in boards]
len(blist)

100

In [67]:
blist[0].df

    0   1   2   3   4
0  57  12  60  96  93
1  73  87  63  70  91
2  74  32  43  67  46
3  59  34   5  35  82
4  53  40  55  29   1

In [68]:
blist[0].mark

       0      1      2      3      4
0  False  False  False  False  False
1  False  False  False  False  False
2  False  False  False  False  False
3  False  False  False  False  False
4  False  False  False  False  False

In [51]:
blist[0].check()

0 0

0

In [52]:
b = blist[0]
type(b)

__main__.Bingo

In [53]:
b.df

    0   1   2   3   4
0  57  12  60  96  93
1  73  87  63  70  91
2  74  32  43  67  46
3  59  34   5  35  82
4  53  40  55  29   1

In [54]:
b.call(12)

In [55]:
b.call(87).call(32).call(34).call(40).mark

       0     1      2      3      4
0  False  True  False  False  False
1  False  True  False  False  False
2  False  True  False  False  False
3  False  True  False  False  False
4  False  True  False  False  False

In [56]:
b.call(67).mark

       0     1      2      3      4
0  False  True  False  False  False
1  False  True  False  False  False
2  False  True  False   True  False
3  False  True  False  False  False
4  False  True  False  False  False

In [57]:
b.check()

1 0

1

In [26]:
df = blist[0].df
df

    0   1   2   3   4
0  57  12  60  96  93
1  73  87  63  70  91
2  74  32  43  67  46
3  59  34   5  35  82
4  53  40  55  29   1

In [30]:
df == 82

       0      1      2      3      4
0  False  False  False  False  False
1  False  False  False  False  False
2  False  False  False  False  False
3  False  False  False  False   True
4  False  False  False  False  False

In [59]:
mask = blist[0].mark
~mask

      0      1     2      3     4
0  True  False  True   True  True
1  True  False  True   True  True
2  True  False  True  False  True
3  True  False  True   True  True
4  True  False  True   True  True

In [60]:
df

    0   1   2   3   4
0  57  12  60  96  93
1  73  87  63  70  91
2  74  32  43  67  46
3  59  34   5  35  82
4  53  40  55  29   1

In [64]:
df[~mask].sum().sum().astype('int')

1085

In [38]:
mask = mask | (df == 82) | (df==32)
mask

       0      1      2      3      4
0  False  False  False  False  False
1  False  False  False  False  False
2  False   True  False  False  False
3  False  False  False  False   True
4  False  False  False  False  False

In [43]:
(mask.sum() > 0).sum()

2

In [46]:
mask.shape[0]

5

In [47]:
mask.T.sum()

0    0
1    0
2    1
3    1
4    0
dtype: int64

In [74]:
done = False
for n in calls:    
    for b in blist:
        res = b.call(n)
        if res:
            print("Called", n, "got", res, "so", n*res)
            done = True
            break
    if done:
        break

Found score! 621
Called 94 got 621 so 58374

In [77]:
for n in calls:
    for b in blist:
        if b.won:
            continue
        res = b.call(n)
        if res:
            print("Called", n, "got", res, "so", n*res)

Found score! 621
Called 94 got 621 so 58374
Found score! 840
Called 71 got 840 so 59640
Found score! 803
Called 90 got 803 so 72270
Found score! 537
Called 96 got 537 so 51552
Found score! 636
Called 75 got 636 so 47700
Found score! 658
Called 75 got 658 so 49350
Found score! 701
Called 58 got 701 so 40658
Found score! 534
Called 58 got 534 so 30972
Found score! 696
Called 82 got 696 so 57072
Found score! 591
Called 14 got 591 so 8274
Found score! 838
Called 27 got 838 so 22626
Found score! 404
Called 27 got 404 so 10908
Found score! 585
Called 27 got 585 so 15795
Found score! 711
Called 49 got 711 so 34839
Found score! 593
Called 49 got 593 so 29057
Found score! 586
Called 49 got 586 so 28714
Found score! 318
Called 49 got 318 so 15582
Found score! 426
Called 69 got 426 so 29394
Found score! 650
Called 69 got 650 so 44850
Found score! 759
Called 69 got 759 so 52371
Found score! 439
Called 89 got 439 so 39071
Found score! 447
Called 89 got 447 so 39783
Found score! 450
Called 89 got 450 so 40050
Found score! 427
Called 37 got 427 so 15799
Found score! 502
Called 13 got 502 so 6526
Found score! 690
Called 1 got 690 so 690
Found score! 486
Called 1 got 486 so 486
Found score! 330
Called 1 got 330 so 330
Found score! 653
Called 1 got 653 so 653
Found score! 720
Called 1 got 720 so 720
Found score! 780
Called 1 got 780 so 780
Found score! 427
Called 1 got 427 so 427
Found score! 346
Called 81 got 346 so 28026
Found score! 597
Called 81 got 597 so 48357
Found score! 641
Called 81 got 641 so 51921
Found score! 586
Called 81 got 586 so 47466
Found score! 398
Called 81 got 398 so 32238
Found score! 443
Called 81 got 443 so 35883
Found score! 505
Called 81 got 505 so 40905
Found score! 578
Called 81 got 578 so 46818
Found score! 651
Called 60 got 651 so 39060
Found score! 516
Called 60 got 516 so 30960
Found score! 566
Called 60 got 566 so 33960
Found score! 353
Called 60 got 353 so 21180
Found score! 536
Called 79 got 536 so 42344
Found score! 465
Called 79 got 465 so 36735
Found score! 271
Called 79 got 271 so 21409
Found score! 449
Called 51 got 449 so 22899
Found score! 765
Called 51 got 765 so 39015
Found score! 446
Called 51 got 446 so 22746
Found score! 384
Called 51 got 384 so 19584
Found score! 525
Called 18 got 525 so 9450
Found score! 830
Called 18 got 830 so 14940
Found score! 516
Called 18 got 516 so 9288
Found score! 546
Called 48 got 546 so 26208
Found score! 507
Called 33 got 507 so 16731
Found score! 322
Called 33 got 322 so 10626
Found score! 368
Called 42 got 368 so 15456
Found score! 357
Called 63 got 357 so 22491
Found score! 415
Called 63 got 415 so 26145
Found score! 317
Called 63 got 317 so 19971
Found score! 338
Called 39 got 338 so 13182
Found score! 612
Called 39 got 612 so 23868
Found score! 306
Called 39 got 306 so 11934
Found score! 458
Called 34 got 458 so 15572
Found score! 354
Called 34 got 354 so 12036
Found score! 318
Called 34 got 318 so 10812
Found score! 378
Called 62 got 378 so 23436
Found score! 347
Called 62 got 347 so 21514
Found score! 472
Called 55 got 472 so 25960
Found score! 556
Called 55 got 556 so 30580
Found score! 306
Called 55 got 306 so 16830
Found score! 366
Called 55 got 366 so 20130
Found score! 701
Called 55 got 701 so 38555
Found score! 559
Called 55 got 559 so 30745
Found score! 394
Called 55 got 394 so 21670
Found score! 429
Called 47 got 429 so 20163
Found score! 345
Called 54 got 345 so 18630
Found score! 478
Called 54 got 478 so 25812
Found score! 421
Called 54 got 421 so 22734
Found score! 372
Called 54 got 372 so 20088
Found score! 415
Called 54 got 415 so 22410
Found score! 512
Called 23 got 512 so 11776
Found score! 479
Called 83 got 479 so 39757
Found score! 492
Called 77 got 492 so 37884
Found score! 454
Called 9 got 454 so 4086
Found score! 277
Called 9 got 277 so 2493
Found score! 450
Called 70 got 450 so 31500
Found score! 267
Called 70 got 267 so 18690
Found score! 376
Called 68 got 376 so 25568
Found score! 285
Called 86 got 285 so 24510
Found score! 451
Called 86 got 451 so 38786
Found score! 415
Called 4 got 415 so 1660
Found score! 250
Called 4 got 250 so 1000
Found score! 437
Called 4 got 437 so 1748
Found score! 341
Called 4 got 341 so 1364
Found score! 223
Called 61 got 223 so 13603
Found score! 246
Called 61 got 246 so 15006
Found score! 248
Called 78 got 248 so 19344
Found score! 367
Called 31 got 367 so 11377